from datetime import timedelta


test_menu_msg = """
*✨ دروازه‌ای به‌سوی شناختی عمیق‌تر از خود ✨*

🧭 زمان آن رسیده که سفری شگفت‌انگیز به درون خود را آغاز کنید؛  
🚶‍♂️ سفری که در هر گام، نوری تازه بر تاریک‌ترین گوشه‌های وجودتان می‌تاباند.  

🎯 همین حالا، گام اول این مسیر الهام‌بخش را بردارید:

📜 _«خودشناسی، والاترین کشف هر انسان است»_
"""

test_completion_msg = (
    "*✅ آزمون شما با موفقیت به پایان رسید.*\n\n"
    "پاسخ‌ها در حال پردازش توسط سامانهٔ هوش مصنوعی است و نتیجهٔ نهایی به‌زودی برایتان ارسال خواهد شد. 🧠📊"
)

start_msg = (
    "سلام! 👋\n"
    "به ربات تست‌های روان‌شناسی و خودشناسی خوش اومدی! 🧠🌀\n"
    "اینجا می‌تونی تست‌های علمی و جذابی رو انجام بدی و با تحلیل هوش مصنوعی، خودتو بهتر بشناسی.\n\n"
    "برای شروع فقط کافیه دستور /test رو بفرستی. 🎯"
)

error_msg = (
    "اوه! یه مشکلی پیش اومده 😕\n"
    "لطفاً چند لحظه صبر کن و دوباره امتحان کن.\n"
    "اگه مشکل ادامه داشت، با پشتیبانی در تماس باش 🙏"
)

no_tests_msg = (
    "فعلاً هیچ تستی در دسترس نیست 🕵️‍♂️\n"
    "لطفاً بعداً دوباره سر بزن یا منتظر باش تا تست‌های جدید اضافه بشن. 🧠✨"
)

already_done_msg = "تو امروز این تست رو انجام دادی! 📅\nلطفاً فردا دوباره امتحان کن ✅"

def get_already_done_msg(remaining: timedelta) -> str:
    total_seconds = int(remaining.total_seconds())
    hours = total_seconds // 3600
    minutes = (total_seconds % 3600) // 60
    
    parts = []
    
    if hours > 0:
        parts.append(f"{hours} ساعت")
    if minutes > 0:
        parts.append(f"{minutes} دقیقه")
    
    if parts:
        time_text = " و ".join(parts)
        return f"تو امروز این تست رو انجام دادی! ⏳\nلطفاً حدود {time_text} دیگه دوباره امتحان کن. ✅"
    else:
        return "تو امروز این تست رو انجام دادی! 📅\nلطفاً فردا دوباره امتحان کن. ✅"

waiting_for_result_msg = (
    "نتیجه‌ای یافت نشد!!!\n"
    "اگر آزمون دادی کمی صبر کن تا نوبتت برسه، به‌زودی برات ارسال میشه. ⏳"
)

already_taken_no_limit_msg = "🔁 شما قبلاً این آزمون رو انجام دادید، اما اگه دوست داری، می‌تونی دوباره انجامش بدی!"

analysis_ready_msg = "✅ تحلیل آزمونت با کمک هوش مصنوعی آماده شده! برای دیدن نتیجه، دکمه زیر رو بزن."

add_test_instruction = """
سلام!
برای افزودن یک تست روانشناسی جدید، لطفاً اطلاعات تست را مطابق الگوی زیر ارسال کنید:

`
title=""

description=""
`

📌 مثال:
title="این یک تست آزمایشی است"

description="تست روانشناسی و شناخت روان و رفتار خود"

پس از ارسال، ربات مراحل بعدی (افزودن سوالات و گزینه‌ها) را راهنمایی خواهد کرد ✅
"""

add_question_instruction = """
    لطفاً سوالات تست را به شکل زیر ارسال کنید:

📌 فرمت نمونه:

1. حال شما چگونه هست؟
- خوب
- بد
- نمیدونم
- نمی‌خوام بگم

2. شما همیشه تنها هستید؟
- بله همیشه تنها هستم
- گاهی
- اصلاً
- تقریباً

❗️ توجه:
- هر تست با test_id مشخص می‌شود.
- هر سوال با شماره‌گذاری (1.، 2. و...) شروع شود.
- هر گزینه با خط تیره (-) در سطر جداگانه نوشته شود.
- لطفاً همه سوالات تست را یکجا ارسال کنید.
"""
